app/controllers/collections_controller.rb

  def index
    @collections = Collection.all
---
SELECT "collections".* FROM "collections"

  def show
    @collection = Collection.find(params[:id])
---
SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT 1  [["id", "4"]]

  def edit
    @collection = Collection.find(params[:id])
---
SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT 1  [["id", "4"]]

  def update
    @collection = Collection.find(params[:id])

    respond_to do |format|
      if @collection.update_attributes(params[:collection])
---
SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "collections" SET "title" = 'Three', "description" = 'This is collection #3.', "updated_at" = '2012-03-28 15:15:00.579804' WHERE "collections"."id" = 4