app/controllers/documents_controller.rb

  def update
    @document = Document.friendly.find(params[:id])

    respond_to do |format|
      if @document.update_attributes(documents_params)
---
SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "documents" SET "title" = 'Three', "description" = 'Document for collection #3.', "updated_at" = '2012-03-28 15:14:40.025804' WHERE "documents"."id" = 5

  def find_document
    @document = Document.friendly.find(params.has_key?(:document_id) ? params[:document_id] : params[:id])
---
SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT 1  [["id", "5"]]